---
kind: property
id: P:Autodesk.Revit.DB.ModelCurveNode.LineProperties
source: html/f40aaef6-b479-80e4-c3c5-994aed11bf53.htm
---
# Autodesk.Revit.DB.ModelCurveNode.LineProperties Property

Access to the line (pen) properties of the curve being drawn

## Syntax (C#)
```csharp
public LineProperties LineProperties { get; }
```